const StructuralPatterns = () => (
  <div>
    <h2>Структурные паттерны (Structural Patterns)</h2>
    <ul>
      <li>
        <strong>Adapter:</strong> Позволяет объектам с несовместимыми
        интерфейсами работать вместе.
      </li>
      <li>
        <strong>Bridge:</strong> Разделяет один или несколько классов на две
        отдельные иерархии — абстракцию и реализацию, позволяя изменять их
        независимо друг от друга.
      </li>
      <li>
        <strong>Composite:</strong> Компонует объекты в древовидные структуры
        для представления иерархий "часть-целое".
      </li>
      <li>
        <strong>Decorator:</strong> Динамически добавляет объектам новые
        обязанности.
      </li>
      <li>
        <strong>Facade:</strong> Предоставляет унифицированный интерфейс к
        набору интерфейсов в подсистеме.
      </li>
      <li>
        <strong>Flyweight:</strong> Использует разделяемые объекты для
        эффективного поддержания большого количества объектов.
      </li>
      <li>
        <strong>Proxy:</strong> Предоставляет объект-заместитель, который
        контролирует доступ к другому объекту.
      </li>
    </ul>
  </div>
);

export default StructuralPatterns;
